// ННГУ, ВМК, Курс "Методы программирования-2", С++, ООП
//
// sample_matrix.cpp - Copyright (c) Гергель В.П. 07.05.2001
//   Переработано для Microsoft Visual Studio 2008 Сысоевым А.В. (20.04.2015)
//
// Тестирование верхнетреугольной матрицы

#include <iostream>
#include "utmatrix.h"
//---------------------------------------------------------------------------

void main()
{
	int n, k;
	setlocale(LC_ALL, "Russian");
	cout << "Тестирование программ поддержки представления треугольных матриц"
		<< endl;
	cout << "Введите порядок матриц: " << endl;
	cin >> n;
	TMatrix<int> a(n), b(n);
	cout << "Введите 1-ю матрицу" << endl;
	cin >> a;
	cout << "Введите 2-ю матрицу" << endl;
	cin >> b;
	cout << "1) 1 + 2" << endl;
	cout << "2) 1 - 2" << endl;
	cin >> k;
	if (k == 1)
		cout << a + b << endl;
	else

		if (k == 2)
			cout << a - b << endl;
		else
			cout << "Операции под таким номером не существует" << endl;
}
//---------------------------------------------------------------------------
